print("🎉вітаю у грі пошуку скарбів🪙")
print("Правила гри не бути москалем!")
vopros1 =input("Куди підеш: Прямо, Наліво, Направо.?!:")
if vopros1 == "Прямо":
    print("🪙Правильно Молодець! ти на один крок біля скарбів!✅")
else:
    print("Не вірно, Подумай ще!")
    vopros1 = input("Куди підеш: Прямо, Наліво, Направо.?!:")
vopros2 =input("Вы выйшли к озеру що ви будите робити?:Перепливу, Обійду,Визову таксі?:")
if vopros2 == "Перепливу":
    print("Ого,Це вірно ще трішки та знайдеш дуже багато скарбів!✅")
else:
    print("Треба ще трішки подумати це не вірно!❌")
    vopros2 = input("Вы выйшли к озеру що ви будите робити?:Перепливу, Обійду,Визову таксі?:")
vopros3 = input("Ви перепливли озеро та побачили військвого! що ви йому скажете?:Привет,Доброго дня!")
if vopros3 =="Доброго дня!":
    print("Все молодець усе вірно✅")
else:
    print("Не вірно!❌)")
    vopros3 = input("Ви перепливли озеро та побачили військвого! що ви йому скажете?:Привет,Доброго дня!")
input(print("🎉🥳Молодець ти знайшов скарб!🪙"))